#+Title 为了适应自己想做的网站 对这个项目进行部分修改
网站用户:
admin:admin
test:qazxcvbn
test2:qazxcvbn
数据库:
djangoblog:hello
***** USEFULL 继续研究表格:插件
CLOSED: [2020-10-31 六 16:36]
:LOGBOOK:
- State "USEFULL"    from "TODO"       [2020-10-31 六 16:36] \\
  看上去能用 就决定 这么解决了
  至少是具备了解决的方案了
CLOCK: [2020-10-31 六 15:40]--[2020-10-31 六 15:51] =>  0:11
CLOCK: [2020-10-31 六 09:54]--[2020-10-31 六 10:00] =>  0:06
:END:
http://vitalets.github.io/x-editable/docs.html

   1. 指标
      1. 丰富的编辑功能
         1. 一般要求
            1. 点击编辑
            2. 删除
            3. 修改
            4. 添加
         2. 进阶要求
            1. 对顺序的优化
               1. 一种可能是 拖动
               2. 一种可能是 重新定义排序
               3. 一种可能是 能够操作都是针对每行的
      2.
   2. [ ] 插件
   3. [ ] 试一试别人写的代码
      1. [ ] js

      2. [ ] html
****** USEFULL X-editable
CLOSED: [2020-10-31 六 16:36]
:LOGBOOK:
- State "USEFULL"    from "TODO"       [2020-10-31 六 16:36] \\
  看上去能够解决一部分的问题
CLOCK: [2020-10-31 六 15:51]--[2020-10-31 六 16:33] =>  0:42
:END:
1. [X] 按照教程来
   1. [X] 添加html 表格
   2. [X] 按照教程进行修改 添加
   3. [X] 测试第一个可以修改的内容
2. [-] 测试功能 调试功能
   1. [X] 有能抄袭的部分吗 没有
   2. [ ] 把原来的  已经完成的其他u部分修改过来
      1. [ ] html部分
      2. [ ] url部分
   3. [ ] 用新建的一个能进行创建的表格
   4. [-] 新建一个符合要求的表格
      1. [X] x部分
      2. [ ] 原来的引用部分
         #+BEGIN_SRC html
   <a href="#" id="username" data-type="text" data-placement="right" data-title="Enter username">superuser</a>

         #+END_SRC
   5. [ ] 实现修改
   6. [ ] 实现删除 行删除
   7. [ ] 实现添加
3. [ ] 修改参数
   1. [ ] url
   2. [ ] scr的链接


****** TODO 按键部分的功能:删除
:LOGBOOK:
CLOCK: [2020-10-31 六 09:43]--[2020-10-31 六 09:54] =>  0:11
:END:
1. [X] 实验删除语句的效果 :tabProduct
   1. [X] 删除i=1 是有效的  删除了 有效内容的第一行
      #+BEGIN_SRC javascript
  tabProduct.deleteRow(1);

      #+END_SRC
2. [C] 实验删除语句的效果 :传递参数 没问题
   1. [ ] 删除i=1
   2. [ ] 删除i=2
   3. [ ] 删除i=3
3. [-] 修改功能代码部分
   1. [-] 逆向思考
      1. [-] 在菜鸟上自己测试程序 完成内容

         1. [-] 点击按键 检测checkbox
            1. [-] 先试试获得checkbox的方法

               1. [X] 抄袭  表格的代码

               2. [X] 抄袭 内容的代码

               3. [ ] 测试
         2. [ ] 点击按键 删除特定行
            #+BEGIN_SRC javascript
      //可以参考的代码
      <input type="checkbox" id="test" class="test">同意
      <script>
          // 获取checkbox元素
          var box=document.getElementById("test");
          // 判断是否被拒选中，选中返回true，未选中返回false
          alert(box.checked);
      </script>


      //他用的代码
      <td align="center" bgcolor="#FFFFFF"><input type="checkbox" name="checkbox2" value="checkbox" /></td>


            #+END_SRC
   2. [ ] 顺向思考

      1. [ ] 如何判断 checkbox被选中了

      2. [ ] table里的checkbox
4. [ ] 测试
